/**
 * drawChip A13画布 MARK
 *
 * 想要中心永远对齐
 * 绘制的对照起点应该是 中心点左上(半宽度, 半宽度)
 * 起始状态为
 * canvas无法从第四象限开始画，故放弃用svg转canvas模拟JSON动画转canvas
 * 直接用SVG好了
 */
// ctx.scale(0.1, 0.1)
function drawChip(ratio = 0) {
  var ctx = document.querySelector('#chip-canvas').getContext('2d')
  if (ratio < 0.1) ratio = 0.1
  const CWIDTH = ctx.canvas.width
  const SMALLWIDTH = 100
  // const CHEIGHT = ctx.canvas.height
  // ctx.clearRect(0, 0, ctx.canvas.width, ctx.canvas.height)
  const translateNum = CWIDTH / 2 - (ratio * CWIDTH) / 2
  ctx.translate(translateNum, translateNum)
  ctx.scale(ratio, ratio)

  //ctx.restore()
  //ctx.save()

  ctx.strokeStyle = 'rgba(0,0,0,0)'
  ctx.lineCap = 'butt'
  ctx.lineJoin = 'miter'
  ctx.miterLimit = 4
  //ctx.save()

  // 背景
  ctx.beginPath()
  ctx.moveTo(893.839695, 31)
  ctx.lineTo(895.066071, 31.0099354)
  ctx.bezierCurveTo(
    935.054114,
    31.6582805,
    967.348376,
    63.956556,
    967.990262,
    103.946169
  )
  ctx.lineTo(968, 105.160305)
  ctx.lineTo(968, 894.839695)
  ctx.lineTo(967.990065, 896.066071)

  ctx.bezierCurveTo(
    967.341719,
    936.054114,
    935.043444,
    968.348376,
    895.053831,
    968.990262
  )
  ctx.lineTo(893.839695, 969)
  ctx.lineTo(104.160305, 969)
  ctx.lineTo(102.933929, 968.990065)
  ctx.bezierCurveTo(
    62.9458856,
    968.341719,
    30.6516243,
    936.043444,
    30.0097379,
    896.053831
  )
  ctx.lineTo(30, 894.839695)
  ctx.lineTo(30, 105.160305)
  ctx.lineTo(30.0099354, 103.933929)
  ctx.bezierCurveTo(
    30.6582805,
    63.9458856,
    62.956556,
    31.6516243,
    102.946169,
    31.0097379
  )
  ctx.lineTo(104.160305, 31)
  ctx.lineTo(893.839695, 31)
  ctx.closePath()
  ctx.moveTo(746.261438, 399)
  ctx.bezierCurveTo(
    720.891068,
    399,
    697.908497,
    406.178571,
    686.267974,
    413.65625
  )
  ctx.lineTo(695.520697, 446.558036)
  ctx.bezierCurveTo(
    703.281046,
    441.772321,
    719.995643,
    434.892857,
    735.814815,
    434.892857
  )
  ctx.bezierCurveTo(
    755.215686,
    434.892857,
    764.46841,
    443.566964,
    764.46841,
    455.232143
  )
  ctx.bezierCurveTo(
    764.46841,
    471.683036,
    745.366013,
    477.665179,
    730.143791,
    477.665179
  )
  ctx.lineTo(712.235294, 477.665179)
  ctx.lineTo(712.235294, 510.267857)
  ctx.lineTo(730.740741, 510.267857)
  ctx.bezierCurveTo(
    750.738562,
    510.267857,
    769.840959,
    518.941964,
    769.840959,
    538.383929
  )
  ctx.bezierCurveTo(
    769.840959,
    552.741071,
    757.901961,
    564.107143,
    734.32244,
    564.107143
  )
  ctx.bezierCurveTo(
    715.816993,
    564.107143,
    697.311547,
    556.629464,
    689.252723,
    552.142857
  )
  ctx.lineTo(680, 586.540179)
  ctx.bezierCurveTo(691.342048, 593.419643, 712.533769, 600, 737.605664, 600)
  ctx.bezierCurveTo(786.854031, 600, 817, 574.875, 817, 540.776786)
  ctx.bezierCurveTo(
    817,
    515.053571,
    798.196078,
    497.40625,
    774.915033,
    493.21875
  )
  ctx.lineTo(774.915033, 492.620536)
  ctx.bezierCurveTo(
    798.793028,
    484.544643,
    810.433551,
    468.09375,
    810.433551,
    447.455357
  )
  ctx.bezierCurveTo(810.433551, 420.834821, 787.45098, 399, 746.261438, 399)
  ctx.closePath()
  ctx.moveTo(486.512195, 395)
  ctx.lineTo(427, 395)
  ctx.lineTo(366, 596)
  ctx.lineTo(412.717073, 596)
  ctx.lineTo(427, 544.408012)
  ctx.lineTo(484.429268, 544.408012)
  ctx.lineTo(499.902439, 596)
  ctx.lineTo(549, 596)
  ctx.lineTo(486.512195, 395)
  ctx.closePath()
  ctx.moveTo(644, 402)
  ctx.lineTo(606.667785, 402)
  ctx.lineTo(555, 425.876923)
  ctx.lineTo(562.466443, 459.901538)
  ctx.lineTo(599.5, 442.292308)
  ctx.lineTo(600.097315, 442.292308)
  ctx.lineTo(600.097315, 596)
  ctx.lineTo(644, 596)
  ctx.lineTo(644, 402)
  ctx.closePath()
  ctx.moveTo(240.531042, 404.280688)
  ctx.lineTo(237.283702, 405.468274)
  ctx.bezierCurveTo(
    227.238818,
    409.107297,
    221.243767,
    410.93207,
    219.349668,
    410.93207
  )
  ctx.bezierCurveTo(
    216.554106,
    410.93207,
    210.17784,
    409.031898,
    200.247412,
    405.284905
  )
  ctx.lineTo(198.837992, 404.763898)
  ctx.bezierCurveTo(
    189.530001,
    401.373803,
    181.984244,
    399.650292,
    176.164334,
    399.650292
  )
  ctx.bezierCurveTo(
    164.996112,
    399.837018,
    154.625512,
    402.75553,
    145.027551,
    408.482713
  )
  ctx.bezierCurveTo(
    135.647735,
    414.079741,
    128.110486,
    421.657892,
    122.392498,
    431.23034
  )
  ctx.lineTo(121.99652, 431.901421)
  ctx.bezierCurveTo(114.661865, 444.214093, 111, 458.907077, 111, 475.942715)
  ctx.bezierCurveTo(
    111,
    490.81457,
    113.715961,
    506.175987,
    119.133835,
    522.039516
  )
  ctx.bezierCurveTo(
    124.192702,
    536.726222,
    130.650134,
    549.608473,
    138.504565,
    560.717633
  )
  ctx.lineTo(139.862999, 562.632356)
  ctx.bezierCurveTo(
    146.584254,
    572.026688,
    152.241437,
    578.731806,
    156.82169,
    582.747709
  )
  ctx.bezierCurveTo(
    164.32913,
    589.765174,
    171.850072,
    593.175357,
    179.394841,
    592.993063
  )
  ctx.lineTo(179.838678, 592.978196)
  ctx.bezierCurveTo(
    184.897548,
    592.805595,
    191.514187,
    591.063893,
    199.727635,
    587.721741
  )
  ctx.bezierCurveTo(
    207.928586,
    584.395242,
    215.595715,
    582.747709,
    222.744623,
    582.747709
  )
  ctx.bezierCurveTo(
    229.561062,
    582.747709,
    237.015908,
    584.395242,
    245.127887,
    587.721741
  )
  ctx.bezierCurveTo(
    253.213333,
    591.063893,
    260.159327,
    592.711447,
    265.919035,
    592.711447
  )
  ctx.bezierCurveTo(
    273.942048,
    592.523152,
    281.434355,
    589.212369,
    288.42717,
    582.747709
  )
  ctx.bezierCurveTo(
    292.938164,
    578.809281,
    298.791526,
    571.716976,
    305.940438,
    561.470815
  )
  ctx.bezierCurveTo(
    311.185053,
    553.954856,
    315.711655,
    545.779887,
    319.535849,
    536.898823
  )
  ctx.bezierCurveTo(321.11236, 533.133, 322.595212, 529.210267, 324, 525.114938)
  ctx.bezierCurveTo(
    317.771435,
    522.489722,
    312.148969,
    518.834501,
    307.090999,
    514.135332
  )
  ctx.lineTo(306.486749, 513.56642)
  ctx.bezierCurveTo(
    294.982938,
    502.849509,
    289.129576,
    489.352176,
    288.957877,
    473.132468
  )
  ctx.bezierCurveTo(
    288.770571,
    452.309041,
    298.182783,
    436.076779,
    317.210116,
    424.487459
  )
  ctx.bezierCurveTo(
    306.580405,
    409.298642,
    290.59682,
    400.867905,
    269.32179,
    399.141902
  )
  ctx.bezierCurveTo(
    261.470478,
    398.4719,
    251.886573,
    400.172802,
    240.531042,
    404.280688
  )
  ctx.closePath()
  ctx.moveTo(454.966443, 430)
  ctx.lineTo(455.557047, 430)
  ctx.lineTo(458.400752, 441.493321)
  ctx.bezierCurveTo(
    460.667056,
    450.623403,
    463.132186,
    460.315337,
    465.597315,
    468.571429
  )
  ctx.lineTo(478, 511)
  ctx.lineTo(434, 511)
  ctx.lineTo(445.812081, 468.571429)
  ctx.bezierCurveTo(449.060403, 457, 452.013423, 441.868132, 454.966443, 430)
  ctx.closePath()
  ctx.moveTo(269.735915, 340)
  ctx.bezierCurveTo(
    263.351502,
    340.327936,
    256.563201,
    342.242941,
    249.386557,
    345.705743
  )
  ctx.bezierCurveTo(
    242.194375,
    349.220995,
    236.263544,
    353.627625,
    231.600286,
    358.927326
  )
  ctx.bezierCurveTo(222.259769, 369.394476, 217, 382.196201, 217, 394.158222)
  ctx.bezierCurveTo(
    217,
    395.811495,
    217.107185,
    397.384794,
    217.292036,
    398.879663
  )
  ctx.bezierCurveTo(
    231.799116,
    400.04695,
    245.176874,
    392.649512,
    256.236994,
    379.84778
  )
  ctx.bezierCurveTo(265.401969, 369.079203, 270, 357.444914, 270, 344.984462)
  ctx.bezierCurveTo(270, 343.33164, 269.922334, 341.665768, 269.735915, 340)
  ctx.closePath()
  ctx.fill()
  ctx.stroke()
  //ctx.restore()
  //ctx.save()
  // 边框
  // drawChip()
  ctx.fillStyle = '#ffffff'
  ctx.beginPath()
  ctx.moveTo(894.279877, 0)
  ctx.bezierCurveTo(
    952.083613,
    0,
    999.052244,
    46.3905942,
    999.985837,
    103.971847
  )
  ctx.lineTo(1000, 105.720123)
  ctx.lineTo(1000, 894.279877)
  ctx.bezierCurveTo(
    1000,
    952.083613,
    953.609406,
    999.052244,
    896.028153,
    999.985837
  )
  ctx.lineTo(894.279877, 1000)
  ctx.lineTo(105.720123, 1000)
  ctx.bezierCurveTo(
    47.9163872,
    1000,
    0.947755733,
    953.609406,
    0.0141634759,
    896.028153
  )
  ctx.lineTo(0, 894.279877)
  ctx.lineTo(0, 105.720123)
  ctx.bezierCurveTo(
    0,
    47.9163872,
    46.3905942,
    0.947755733,
    103.971847,
    0.0141634759
  )
  ctx.lineTo(105.720123, 0)
  ctx.lineTo(894.279877, 0)
  ctx.closePath()
  ctx.moveTo(892.997819, 31)
  ctx.lineTo(105.002181, 31)
  ctx.bezierCurveTo(
    64.5406078,
    31,
    31.6634119,
    63.4725801,
    31.0099142,
    103.77842
  )
  ctx.lineTo(31, 105.002181)
  ctx.lineTo(31, 892.997819)
  ctx.bezierCurveTo(
    31,
    933.459392,
    63.4725801,
    966.336588,
    103.77842,
    966.990086
  )
  ctx.lineTo(105.002181, 967)
  ctx.lineTo(892.997819, 967)
  ctx.bezierCurveTo(
    933.459392,
    967,
    966.336588,
    934.52742,
    966.990086,
    894.22158
  )
  ctx.lineTo(967, 892.997819)
  ctx.lineTo(967, 105.002181)
  ctx.bezierCurveTo(
    967,
    64.5406078,
    934.52742,
    31.6634119,
    894.22158,
    31.0099142
  )
  ctx.lineTo(892.997819, 31)
  ctx.closePath()
  ctx.fill()
  ctx.stroke()
  //ctx.restore()
  //ctx.restore()
}
